Revit 2024 API
DocumentEntryPoint Class
For Revit Macros use only.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class DocumentEntryPoint : UIDocument,
	IEntryPoint
Visual Basic
Public MustInherit Class DocumentEntryPoint _
	Inherits UIDocument _
	Implements IEntryPoint
Visual C++
public ref class DocumentEntryPoint abstract : public UIDocument,
	IEntryPoint
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIDocument
 Autodesk.Revit.UI.Macros.DocumentEntryPoint
See Also
DocumentEntryPoint Members
Autodesk.Revit.UI.Macros Namespace